app/controllers/suggestions_controller.rb

INSERT INTO "suggestions" ("created_at", "description", "emails", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 05 Apr 2012 01:57:55 UTC +00:00], ["description", "youtube"], ["emails", "d@a.com"], ["updated_at", Thu, 05 Apr 2012 01:57:55 UTC +00:00]]
---
  def create
    @suggestion = Suggestion.create(params[:suggestion])

SELECT "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @suggestion = Suggestion.find(params[:id])